Repository: Nuhser/UltraStar-Deluxe-Editor
Catalog: UltraStarDeluxeEditor/Properties/Resources.*.resx
Languages: de

# usdPathNotConfiguredCaption
source: No UltraStar Directory
de: Kein UltraStar-Ordner

# usdPathNotConfiguredMessage
source: You have no UltraStar path configured at the moment. Please select your UltraStar Deluxe directory in order to move on.
de: Du hast momentan keinen UltraStar-Ordner eingestellt. Bitte wähle einen Ordner aus, um fortzufahren.

# usdPathNotValidCaption
source: UltraStar directory not valid
de: UltraStar-Ordner nicht gültig

# usdPathNotValidMessage
source: The folder you selected isn't an UltraStar Directory. Please select another one.
de: Der Ordner, den du ausgewählt hast, ist kein UltraStar-Ordner. Bitte wähle einen anderen.

# songListInitializationDoneMessage
source: {0} valid UltraStar song(s) where found.
de: Es wurde(n) {0} gültige(r) UltraStar-Song(s) gefunden.

# songListInitializationDoneCaption
source: Songlist Initialization Done
de: Songlisten Initialisierung Beendet

# coverDownloadFromUrl
source: Download Cover Image from URL
de: Cover-Bild von URL herunterladen

# unsavedChangesMessage
source: You have unsaved changes. Do you want to save all changes before closing?
de: Du hast ungespeicherte Änderungen. Willst du alles speichern bevor du das Programm schließt?

# unsavedChangesCaption
source: Unsaved Changes
de: Ungespeicherte Änderungen

# reloadSongsMessage
source: Are you sure that you want to reload all songs from the song directories? Unsaved changes will be lost.
de: Bist du sicher, dass du die Songs aus den Songordnern neu laden willst? Alle ungespeicherten Änderungen gehen dabei verloren.

# reloadSongsCaption
source: Reload Songs
de: Songs neu laden

# coverDownloadSuccessMessage
source: Cover successfully downloaded.
de: Cover erfolgreich heruntergeladen.

# successCaption
source: Success
de: Erfolg

# coverDownloadErrorMessage
source: Something went wrong while downloading the new cover image. Make sure that the URL leads to an image in JPG or PNG format.
de: Etwas ist während dem Herunterladen des neuen Covers schiefgelaufen. Stelle sicher, dass die URL zu einem Bild im JPG- oder PNG-Format führt.

# coverDownloadErrorCaption
source: Cover Download Error
de: Fehler während Cover Download

# coverDownloadUrlInputMessage
source: Please enter the URL of the image you want to download as the new cover.
de: Bitte gib die URL des Bildes ein, das du als neues Cover herunterladen willst.

# urlInputCaption
source: Enter URL
de: URL eingeben

# coverOverwriteCaption
source: Overwrite Cover
de: Cover überschreiben

# coverOverwriteMessage
source: Are you sure that you want to set a new cover image? This will delete the old one after saving.
de: Bist du sicher, dass du ein neues Cover-Bild verwenden willst? Das würde das alte Bild beim Speichern löschen.

# fileDeleteCaption
source: Delete File
de: Datei löschen

# fileDeleteErrorCaption
source: File Deletion Error
de: Fehler während Datei löschen

# fileDeleteErrorMessage
source: An error occured while deleting the file.
de: Während des Löschens der Datei ist ein Fehler aufgetreten.

# coverDeleteMessage
source: Are you sure that you want to delete the cover image? This will also delete the image file from your drive.
de: Bist du sicher, dass du das Cover-Bild löschen willst? Dies löscht beim nächsten Speichern ebenfalls die Bilddatei.

# reloadSongCaption
source: Reload Song
de: Song neu laden

# reloadSongErrorMessage
source: An unexpected error occured while reloading{0}!
de: Während des Ladens des Songs{0} ist ein unerwarteter Fehler aufgetreten!

# errorCaption
source: Error
de: Fehler

# reloadSongMessage
source: Are you sure that you want to reload the selected song? Unsaved changes will be lost.
de: Bist du sicher, dass du den Song neu laden willst? Ungespeicherte Änderungen gehen dabei verloren.

# reloadSongSuccessMessage
source: "{0}" was reloaded successfully.
de: "{0}" wurde erfolgreich geladen.

# songListInitializationErrorsMessage
source: {0} invalid song(s) files where found.
de: Es wurde(n) {0} ungültige(r) Song(s) gefunden.

# reloadSongFileNotFoundErrorMessage
source: The song couldn't be reloaded due to the file {0} not existing.
de: Der Song konnte nicht neu geladen werden, da die Datei{0} nicht existiert.

# mp3FileNotExistsWarningIcon
source: MP3 file doesn't exist
de: MP3-Datei existiert nicht

# videoFileNotExistsWarningIcon
source: Video file doesn't exist
de: Die Video-Datei existiert nicht.

# coverSelectFileCaption
source: Select Cover Image
de: Cover-Bild wählen

# imageFileFilter
source: JPG or PNG|*.jpg;*.jpeg;*.png
de: JPG oder PNG|*.jpg;*.jpeg;*.png

# findUsdFolderDescription
source: Choose the folder of your UltraStar Deluxe installation.
de: Wähle den Ordner deiner UltraStar Deluxe Installation.

# saveSongCaption
source: Save Song
de: Song speichern

# textFileFilter
source: Text File|*.txt
de: Text Datei|*.txt

# exportSongSaveFirstMessage
source: You need to save the song before exporting it. Do you want to do this now?
de: Du musst deinen Song zunächst speichern, bevor du ihn exportieren kannst. Willst du das jetzt tun?

# exportSongTitle
source: Choose export destination
de: Wähle das Exportziel

# saveSongErrorMessage
source: An unexpected error occured while trying to save the song{0}.
de: Während des Speicherns des Songs{0} ist ein unerwarteter Fehler aufgetreten.

# songNotPlayableCaption
source: Song not playable
de: Song nicht spielbar

# songNotPlayableMessage
source: The song you're trying to save is currently not playable. Are you sure that you want to save it?
de: Der Song, den du speichern willst, ist aktuell nicht spielbar. Bist du sicher, dass du ihn speichern willst?

# songsNotPlayableMessage
source: At least one of the songs you're trying to save is currently not playable. Are you sure that you want to save?
de: Mindestens einer der Songs, die du speichern willst, ist aktuell nicht spielbar. Bist du sicher, dass du speichern willst?

# titleMissingWarningIcon
source: Song title missing
de: Songtitel fehlt

# artistMissingWarningIcon
source: Artist missing
de: Interpret fehlt

# mp3FileMissingWarningIcon
source: MP3 file missing
de: MP3-Datei fehlt

# player1TextMissingWarningIcon
source: Song text for player 1 missing
de: Songtext für Spieler 1 fehlt

# player2TextMissingWarningIcon
source: Song text for player 2 missing
de: Songtext für Spieler 2 fehlt

# mp3SelectFileCaption
source: Select MP3 File
de: MP3-Datei wählen

# videoOverwriteMessage
source: Are you sure that you want to use a new video for this song? This will delete the old one after saving.
de: Bist du sicher, dass du ein neues Video für diesen Song verwenden willst? Das würde das alte Bild beim Speichern löschen.

# mp3OverwriteMessage
source: Are you sure that you want to use a new MP3 file? This will delete the old one after saving.
de: Bist du sicher, dass du eine neue MP3-Datei verwenden willst? Das würde das alte Bild beim Speichern löschen.

# mp3OverwriteCaption
source: Overwrite MP3
de: MP3 überschreiben

# videoOverwriteCaption
source: Overwrite Video
de: Video überschreiben

# mp3DeleteMessage
source: Are you sure that you want to delete the MP3? This will also delete the music file from your drive.
de: Bist du sicher, dass du die MP3 löschen willst? Dies löscht beim nächsten Speichern ebenfalls die Musikdatei.

# videoDeleteMessage
source: Are you sure that you want to delete the video? This will also delete the file from your drive.
de: Bist du sicher, dass du das Video löschen willst? Dies löscht beim nächsten Speichern ebenfalls die Videodatei.

# newSongTitleOrArtistMissingErrorMessage
source: You need to enter a song title as well as an artist.
de: Du musst einen Songtitel und einen Interpreten eingeben.

# newSongErrorWhileCreationMessage
source: An unexpected error occured while trying to create the song "{0}" by "{1}" in the song directory "{2}".
de: Ein unerwarteter Fehler ist während der Erstellung des Songs "{0}" von "{1}" im Ordner "{2}" aufgetreten.
